tylerlinquata/STM32-soil-sensor/Lab Makefile/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * COPYRIGHT(c) 2020 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f0xx_hal.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void Error_Handler(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */
	
  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* Configure the system clock */
  SystemClock_Config();

  /* Initialize all configured peripherals */

  /* USER CODE BEGIN 2 */
	
	/*
	 *	initialize GPIO 
	 */
	RCC->AHBENR |= RCC_AHBENR_GPIOBEN | RCC_AHBENR_GPIOCEN | RCC_AHBENR_GPIOAEN;  // enable GPIOA GPIOB and GPIOC 
	
	GPIOB->MODER |= (1 << 23) | (1 << 27) | (1 << 28); // PB11 AF, PB13 AF, PB14 output
	GPIOC->MODER |= (1 << 0);	// PC0 output 
	GPIOC->MODER 	|= (1 << 12) 	| (1 << 14) 
								|  (1 << 16)  | (1 << 18) ; // initialize LEDS
	
	GPIOB->OTYPER |= (1 << 11) | (1 << 13);  // PB11 and PB13 open-drain
	
	GPIOB->PUPDR |= (1 << 22) | (1 << 26);   // PB11 and PB13 to pull-up
	
	GPIOB->AFR[1] |= (1 << 12) | (5 << 20);	 // set PB11 to SDA and PB13 to SCL
	
	GPIOB->ODR |= (1 << 14);  // initialize PB14
	GPIOC->ODR |= (1 << 0);		// initialize PC0
	GPIOC->ODR |= (0 << 6)   | (0 << 7)  | (0 << 8)  | (0 << 9)	; // all LEDS off
	
	/*
	 *	initialize I2C2
	 */
	RCC->APB1ENR |= RCC_APB1ENR_I2C2EN;  // emable the ISC2
	
	I2C2->TIMINGR |= (0x13 << 0) | (0xF << 8) | (0x2 << 16) | (0x4 << 20) | (1 << 28); // configure timing to 100kHz
	I2C2->CR1 |= (1 << 0); // enable I2C2
	
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  uint16_t cap_low, cap_high, cap;
  while (1)
  {
		HAL_Delay(100);

  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
		// ask for moisture values
		I2C2->CR2 &= ~((0x7F << 16) | (0x3FF << 0));
		I2C2->CR2 |= (0x36 << 1); // set slave address to 0x6B
		I2C2->CR2 |= (2 << 16);		// set number of bytes to 2
		I2C2->CR2 &= ~(1 << 10);	// set RD_WRN to write
		I2C2->CR2 |= (1 << 13);		// set the start bit

		// wait for a NACKF or TXIS
		while(!(I2C2->ISR & ((1 << 4) | (1 << 1)))) {}

		// write the address of the soil sensor (0x0F)
		I2C2->TXDR = (0xA8 << 0);	

		// wait for NACKF or TXIS
		while(!(I2C2->ISR & ((1 << 4) | (1 << 1)))) {}

		// write the address of the touch function (0x10)
		I2C2->TXDR = (0x10 << 0);
			
		// wait for TC
		while(!(I2C2->ISR & (1 << 6))) {}
			
		// set the stop bit
		I2C2->CR2 |= (1 << 14);
			
		// read in moisture value
		I2C2->CR2 &= ~((0x7F << 16) | (0x3FF << 0));
		I2C2->CR2 |= (0x36 << 1); // set slave address to 0x6B
		I2C2->CR2 |= (2 << 16);		// set number of bytes to 2
		I2C2->CR2 |= (1 << 10);		// set RD_WRN to read
		I2C2->CR2 |= (1 << 13);		// set the start bit
			
		// wait for RXNE or NACKF
		while(!(I2C2->ISR & ((1 << 2) | (1 << 1)))) {}

		// read in data
		cap_low = I2C2->RXDR;
			
		// wait for RXNE or NACKF
		while(!(I2C2->ISR & ((1 << 2) | (1 << 1)))) {}
		
		cap_high = (I2C2->RXDR << 8);
			
		// wait for TC
		while(!(I2C2->ISR & (1 << 6))) {}

		if(cap_low > 200) {
			GPIOC->ODR |= (1 << 9);
			// GPIOC->ODR &= ~(1 << 7);
		}
		if(cap_high != 0) {
			GPIOC->ODR |= (1 << 8);
		}
		if((cap_high | cap_low) != 0) {
			GPIOC->ODR |= (1 << 7);
		}
		
  }
  /* USER CODE END 3 */

}
//*****************************
//taken from lab 7, sets up the pwm
//probably does too much and we won't need half of it
void pwm_init(void) 
{
	// Set up pin PA4 for H-bridge PWM output (TIMER 14 CH1)    
	GPIOA->MODER |= (1 << 9);    
	GPIOA->MODER &= ~(1 << 8);    
	// Set PA4 to AF4,   
	GPIOA->AFR[0] &= 0xFFF0FFFF; // clear PA4 bits,    
	GPIOA->AFR[0] |= (1 << 18);    
	
	// Set up a PA5, PA6 as GPIO output pins for motor direction control    
	GPIOA->MODER &= 0xFFFFC3FF; // clear PA5, PA6 bits,    
	GPIOA->MODER |= (1 << 10) | (1 << 12);    
	
	//Initialize one direction pin to high, the other low    
	GPIOA->ODR |= (1 << 5);    
	GPIOA->ODR &= ~(1 << 6);   
	
	// Set up PWM timer    
	RCC->APB1ENR |= RCC_APB1ENR_TIM14EN;    
	TIM14->CR1 = 0;                         
	// Clear control registers    
	TIM14->CCMR1 = 0;                       
	// (prevents having to manually clear bits)    
	TIM14->CCER = 0;    

	// Set output-compare CH1 to PWM1 mode and enable CCR1 preload buffer    
	TIM14->CCMR1 |= (TIM_CCMR1_OC1M_2 | TIM_CCMR1_OC1M_1 | TIM_CCMR1_OC1PE);    
	TIM14->CCER |= TIM_CCER_CC1E;           // Enable capture-compare channel 1    
	TIM14->PSC = 1;                         // Run timer on 24Mhz    
	TIM14->ARR = 1200;                      // PWM at 20kHz    
	TIM14->CCR1 = 0;                        // Start PWM at 0% duty cycle
    TIM14->CR1 |= TIM_CR1_CEN;              // Enable timer
	
}

//does our EXTI and NVIC setup 
void NVIC_EXTI_Setup()
{
	RCC->APB2ENR  |= RCC_APB2ENR_SYSCFGCOMPEN; // enable SYSCFG

	//TODO: determine if we're actually using line 0 or what
	// configure EXTI 
	EXTI->IMR  |= (1 << 0); // unmask interrupt request line 0
	EXTI->RTSR |= (1 << 0); // rising trigger enabled line 0

	//TODO: determine the proper routing (line 0 or nah)
	SYSCFG->EXTICR[1] |= (0 << 0) | (0 << 1) | (0 << 2) | (0 << 3); //route PA0 to EXTI 
	
	//TODO: implement NVIC Handlers and such, determine priority
	NVIC_EnableIRQ(/*EXTI0_1_IRQn*/);
	NVIC_SetPriority(/*EXTI0_1_IRQn*/, 2); //priority set to 2
	

}

//function that probably needs to be called by the Interrupt handler
//the handler should call this fucntion then clear the interrupt status register
// this function should power the motor on for 5 seconds
void PWM_Motor(void) 
{
	//TODO: implement
	//powers the motor for a short period of time using PWM_Motor
	//run for like 5 seconds
}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = 16;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    Error_Handler();
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
